<a href="https://colab.research.google.com/github/Riiyya/BootcampProject/blob/main/Project_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

we use pandas read_csv function to read the csv file in the Python and pandas DataFrame method to convert file into the data frame

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Separating out the columns which have more than 40% of the values missing in the dataset

In [ ]:
 
x= df.isnull().sum()
 
drop_col = df.isnull().sum()[df.isnull().sum()>(40/100*df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

because Embarked contains string values, we see the detail of that column separately from others as string does not have mean and all

In [ ]:
df['Embarked']. describe ()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For Embarked attribute , we fill the null values with the most frequent value in the column

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df.fillna(df.mean(),inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
 df['Embarked'].fillna('S',inplace = True)

In [ ]:
 df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

sibsp:Number of Siblings/Spouses Abroad
patch: Number of Parents/Children Abroad
 
So we can make a new column family_size by combining these two columns

In [ ]:
df['FamilySize'] = df['Parch']
df.drop(['SibSp' , 'Parch'] , axis = 1 , inplace = True ) 
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.001652
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.081629
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.018443
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.179191
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.216225
FamilySize     -0.001652  0.081629  0.018443 -0.179191  0.216225    1.000000

FamilySize in the ship does not have much for reliance with survival rate

Let's check if we whether the person was alone or not 10 affect the survival rate

In [ ]:
df['Alone'] = [ 0 if df ['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          0      1
1            2         1       1  ...        C          0      1
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          0      1
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows female passengers have more chance of surviving then male once.

It shows women were prioritised over men.

CONCLUSION

•Female passengers were prioritised over men.
•Passengers travelling with their family have higher survival rate.
•People with high class or rich people have higher survival rate than others the hierarchy might have been followed while saving the passengers.